Importing pandas

In [2]:
import pandas as pd

Pandas has two data types
1. Series
2. Dataframes

# Series Example

In [3]:
rainbow = pd.series["violet","indigo","blue","green","yellow","orange","red"]

AttributeError: module 'pandas' has no attribute 'series'

In [ ]:
rainbow = pd.Series["violet","indigo","blue","green","yellow","orange","red"]

In [4]:
rainbow = pd.Series(["violet","indigo","blue","green","yellow","orange","red"])

In [5]:
rainbow

0    violet
1    indigo
2      blue
3     green
4    yellow
5    orange
6       red
dtype: object

# Series is 1-Dimensional

In [6]:
vehicles = pd.Series(["car","bus","bike","bicycle","ship","boat","flight"])

In [7]:
vehicles

0        car
1        bus
2       bike
3    bicycle
4       ship
5       boat
6     flight
dtype: object

# Dataframes example

In [8]:
vehicle_data = pd.DataFrame{"Vehicle Type": vehicles,"Colour":rainbow}

SyntaxError: invalid syntax (<ipython-input-8-a9f6d39e2943>, line 1)

In [9]:
vehicle_data = pd.DataFrame({"Vehicle Type": vehicles,"Colour":rainbow})

In [10]:
vehicle_data

  Vehicle Type  Colour
0          car  violet
1          bus  indigo
2         bike    blue
3      bicycle   green
4         ship  yellow
5         boat  orange
6       flight     red

# Data Frame is 2-Dimensional

Lets import some data

In [23]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

Lets export the data now

In [24]:
car_sales.to_csv("exported_sales.csv")

In [25]:
car_sales.to_excel("exported_sales.xlsx")

In [26]:
exported_sales = pd.read_csv("exported_sales.csv")
exported_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [27]:
exported_sales = pd.read_excel("exported_sales.xlsx")
exported_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

Index is duplicated and it needs to be avoided.

In [28]:
car_sales.to_csv("exported_sales.csv", index=False)

In [29]:
car_sales.to_excel("exported_sales.xlsx", index=False)

In [30]:
exported_sales = pd.read_csv("exported_sales.csv")
exported_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [31]:
exported_sales = pd.read_excel("exported_sales.xlsx")
exported_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describing Data

In [32]:
car_sales.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [33]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [34]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [35]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [36]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [37]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [39]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [40]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [41]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [42]:
car_sales["Doors"].sum()

40

In [43]:
len(car_sales)

10